In [31]:
import sys
sys.path.append('../src')
#from mlsalario.config import data_sample as data
from MLsalario.config import data_sample as data
import matplotlib.pyplot as plt
import pickle

In [2]:
df = data

In [3]:
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [4]:
df['experience'].fillna('zero',inplace=True)

In [5]:
df['test_score'].fillna(df['test_score'].mean(),inplace=True)

In [6]:
df = df.copy()

In [7]:
df

  experience  test_score  interview_score  salary
0       zero    8.000000                9   50000
1       zero    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [8]:
X = df.iloc[:,:3]
X

  experience  test_score  interview_score
0       zero    8.000000                9
1       zero    8.000000                6
2       five    6.000000                7
3        two   10.000000               10
4      seven    9.000000                6
5      three    7.000000               10
6        ten    7.857143                7
7     eleven    7.000000                8

In [9]:
# converter experiencia em numeros , usando dicionario

def converter_to_int(palavras):
    dic_palavras = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}
    return dic_palavras[palavras]

In [10]:
X['experience'] = X['experience'].apply(lambda x : converter_to_int(x))

In [14]:
X=X.values

In [15]:
y = df.iloc[:, -1].values
y

array([50000, 45000, 60000, 65000, 70000, 62000, 72000, 80000])

In [16]:
from sklearn.model_selection import train_test_split
X_Train, X_Test, Y_Train, Y_Test = train_test_split(X, y, test_size = 0.7, random_state = 0)

In [17]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
regressor.fit(X_Train, Y_Train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [18]:
Y_Pred = regressor.predict(X_Test)

In [30]:
Y_Pred

array([71269.84126984, 66000.        , 63333.33333333, 70888.88888889,
       62444.44444444, 60666.66666667])

In [35]:
# Saving model to disk
pickle.dump(regressor, open('/home/re91921z@nimbus.local/Documentos/DataScience/MLsalario/mlsalario.pkl','wb'))

In [36]:
# Loading model to compare the results
model = pickle.load(open('/home/re91921z@nimbus.local/Documentos/DataScience/MLsalario/mlsalario.pkl','rb'))
print(model.predict([[2, 9, 6]]))

[65555.55555556]